tests/fixtures/initTransaction.request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><Signature xmlns="http://www.w3.org/2000/09/xmldsig#">\n<SignedInfo>\n<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>\n<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>\n<Reference URI="#id-fb58a5e9-37db-45bd-882c-f140d0e87879">\n<Transforms>\n<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>\n</Transforms>\n<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>\n<DigestValue>sqQV1OFNHEoWA7Xmlo6wQvytKZk=</DigestValue>\n</Reference>\n</SignedInfo>\n<SignatureValue>wHU9cjllvQldWQbt2XT2dhKn9FaMLr33Rfzd9fc4VO1u+iv/Hxrgqxs8iOh8kMEN\nsESdo93pI5P8h1Eqe7y+pm9uBPIyKh6Lp4EM1+4AHdooPD1flqscIiFi60t/tyYx\nAzodQHDsbAZm1Srlb7PgYubzvUz0pYB4oFN8qNs00v/Y5IMeXrKm0IZQSQdCM2kc\nR7pSeCQLJ7JLIQtRuFouWnSaEfuU5mInJCntWZps2KGWFxaJmTwd55CBDkVbAdSV\nVQXDRV65KAi/IAlDkZT6GHXLy2z9GineIQgRn8JwzaVg/PFA2E+hs7W22MiRFXKZ\nXjO4XiHbOWT2yTtyWeJnUQ==</SignatureValue>\n<KeyInfo>\n<wsse:SecurityTokenReference><X509Data>\n\n\n<X509Certificate>MIIDujCCAqICCQCZ42cY33KRTzANBgkqhkiG9w0BAQsFADCBnjELMAkGA1UEBhMC\nQ0wxETAPBgNVBAgMCFNhbnRpYWdvMRIwEAYDVQQKDAlUcmFuc2JhbmsxETAPBgNV\nBAcMCFNhbnRpYWdvMRUwEwYDVQQDDAw1OTcwMjAwMDA1NDExFzAVBgNVBAsMDkNh\nbmFsZXNSZW1vdG9zMSUwIwYJKoZIhvcNAQkBFhZpbnRlZ3JhZG9yZXNAdmFyaW9z\nLmNsMB4XDTE2MDYyMjIxMDkyN1oXDTI0MDYyMDIxMDkyN1owgZ4xCzAJBgNVBAYT\nAkNMMREwDwYDVQQIDAhTYW50aWFnbzESMBAGA1UECgwJVHJhbnNiYW5rMREwDwYD\nVQQHDAhTYW50aWFnbzEVMBMGA1UEAwwMNTk3MDIwMDAwNTQxMRcwFQYDVQQLDA5D\nYW5hbGVzUmVtb3RvczElMCMGCSqGSIb3DQEJARYWaW50ZWdyYWRvcmVzQHZhcmlv\ncy5jbDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBANApVXB/EQtbviqQ\nj1J82EiHJslyPO0RLAZEM2gNUCXuMPwe4OirylfQ2qn5zYTL3ff8qZhn9EQ0D4ZQ\nWxpc8pis9cYdJUAQ/vTGa4PCbvP3dZNKSG9UC0A54UYEdk9eJ4F6T+DyECrauw7H\nRwcmxVOb7wClanR7yJmRc6nsW2Y11scYU/v7BnA+FbOu933Ogfl49lKyhe0MleaT\nA6tBwgi0zJmn1gJjax8peopkDPm6gtdoJxBABJKyYkjuj/9tZvYgybOSkGp6SW8t\nGhlvJqHGERwzB2Y7U4iD9PiQCYC/SrB/q13ZNm0+2nq3u08ziv2xMIZGBF5zDLf+\nub1egH8CAwEAATANBgkqhkiG9w0BAQsFAAOCAQEAdgNpIS2NZFx5PoYwJZf8faze\nNmKQg73seDGuP8d8w/CZf1Py/gsJFNbh4CEySWZRCzlOKxzmtPTmyPdyhObjMA8E\nAdps9DtgiN2ITSF1HUFmhMjI5V7U2L9LyEdpUaieYyPBfxiicdWz2YULVuOYDJHR\nn05jlj/EjYa5bLKs/yggYiqMkZdIX8NiLL6ZTERIvBa6azDKs6yDsCsnE1M5tzQI\nVVEkZtEfil6E1tz8v3yLZapLt+8jmPq1RCSx3Zh4fUkxBTpUW/9SWUNEXbKK7bB3\nzfB3kGE55K5nxHKfQlrqdHLcIo+vdShATwYnmhUkGxUnM9qoCDlB8lYu3rFi9w==</X509Certificate>\n<X509IssuerSerial>\n<X509IssuerName>emailAddress=integradores@varios.cl,OU=CanalesRemotos,CN=597020000541,L=Santiago,O=Transbank,ST=Santiago,C=CL</X509IssuerName>\n<X509SerialNumber>11088820064041996623</X509SerialNumber>\n</X509IssuerSerial>\n</X509Data>\n</wsse:SecurityTokenReference></KeyInfo>\n</Signature></wsse:Security></soap-env:Header><soap-env:Body xmlns:ns0="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ns0:Id="id-fb58a5e9-37db-45bd-882c-f140d0e87879"><ns0:initTransaction xmlns:ns0="http://service.wswebpay.webpay.transbank.com/"><wsInitTransactionInput><wSTransactionType>TR_NORMAL_WS</wSTransactionType><commerceId>597020000541</commerceId><buyOrder>12341</buyOrder><sessionId></sessionId><returnURL>http://127.0.0.1:5000/return</returnURL><finalURL>http://127.0.0.1:5000/final</finalURL><transactionDetails><amount>10000</amount><commerceCode>597020000541</commerceCode><buyOrder>12341</buyOrder></transactionDetails></wsInitTransactionInput></ns0:initTransaction></soap-env:Body></soap-env:Envelope>
